[
    {
        "organization": "Alberta Gaming and Liquor Comission (AGLC) - Alberta Manufacturers Improvements Team",
        "title": "Web Developer",
        "startDate": "June 2020",
        "endDate": "November 2020",
        "location": "Edmonton & St. Albert, AB Canada",
        "type": "professional",
        "experiences": [
            "Sole web developer on a project to apply new remittance model changes to AGLC’s Liquor Sales Application (LSA) as a part of their Alberta Manufacturers Improvements (AMI) project.",
            "Met with team of 4 to 10 people in daily stand-up/scrum meetings to provide status.",
            "Conducted demos for business staff.",
            "Met with project manager to review and update project Gantt chart.",
            "Met with business analyst to review and discuss and in some cases suggest solutions for user friendly UI behaviours.",
            "Met with technical staff to discuss application architecture, deployment, unit tests and source code management to decide on standards.",
            "Created Visual Studio unit tests that would run in TFS upon build to notify developers if anything broke.",
            "Created builds and deployments to QA environment in order for QA tester to test features and bugs."
        ],
        "experiencesSimplified": [
            "Sole web developer on a project to apply new remittance model changes to AGLC’s Liquor Sales Application (LSA) as a part of their Alberta Manufacturers Improvements (AMI) project.",
            "Met with team of 4 to 10 people (with a mixed agile-waterfall approach) in daily stand-up/scrum meetings to provide status.",
            "Conducted demos for business staff.",
            "Met with project manager to review and update project Gantt chart.",
            "Tools/Technologies/Languages/Frameworks: Visual Studio, Visual Studio Unit Tests, CSS, Bootstrap, jQuery, JavaScript, ASP.NET MVC, WebAPI, C#, Entity Framework, SQL Server, Git, Team Foundation Server (TFS)."
        ]
    },
    {
        "organization": "Service Alberta / Alberta Education SFSSI Team",
        "title": "Application Developer",
        "startDate": "March 2020",
        "endDate": "May 2020",
        "location": "Edmonton, AB Canada",
        "type": "professional",
        "experiences": [
            "Helped maintain a list of 7 web and Windows based applications",
            "Participated with an agile team of 8 people (4 developers, 2 business analysts, 1 system tester and 1 team lead) in daily scrums and bi-weekly spring planning sessions to coordinate and plan development 3changes for business users",
            "Technologies/Languages used: ASP.NET Web Forms, Windows Forms, ASP.NET MVC, Angular, C#, Powershell, BuildMaster, SharePoint",
            "Scheduled and performed deployments to system test, UAT and production through BuildMaster and GoA’s DECO system"
        ],
        "experiencesSimplified": [
            "Helped maintain a list of 7 web and Windows based applications making changes to UI, business logic and database model.",
            "Participated with an agile team of 8 people (4 developers, 2 business analysts, 1 system tester and 1 team lead) in daily scrums and bi-weekly spring planning sessions to coordinate and plan development changes for business users.",
            "Tools/Technologies/Languages/Frameworks: Visual Studio, Azure DevOps (TFS), ASP.NET Web Forms, Windows Forms, ASP.NET MVC, HTML, CSS, Bootstrap, jQuery, JavaScript, Angular, C#, PowerShell, BuildMaster, SharePoint and SQL Server."            
        ]
    },
    {
        "organization": "Stream Property Solutions Ltd.",
        "title": "Full Stack Microsoft.NET Web Developer",
        "startDate": "Apr 2019",
        "endDate": "Jan 2020",
        "location": "Edmonton, AB Canada",
        "type": "professional",
        "experiences": [
            "Developed and delivered features and functionality for this Canada wide startup real estate platform on a very small team of 2 developers, 1 designer, 1 data analyst and 2 realtors.",
            "Tools and Technology used: Amazon Web Services (AWS), AWS Elastic BeanStalk,  AWS S3 Bucket, SQL Server and SMSS, .NET Core 2.2, WebAPI, ASP.NET MVC, jQuery, JavaScript, UIKit",
            "Utilized Trello for project management and task management",
            "Interfaced with the designer to implement screen mockups made in Zeplin"
        ],
        "experiencesSimplified": [
            "Designed, developed and delivered features and functionality for this Canada wide start up real estate platform on a very small team of 2 developers, 1 designer, 1 data analyst and 2 realtors.",
            "Tools/Technologies/Languages/Frameworks: Visual Studio, Amazon Web Services (AWS), AWS Elastic BeanStalk, AWS S3 Bucket, Git, Visual Studio Unit Tests, Postman, Zeplin, Trello, Dropbox, SQL Server and SMSS, .NET Core 2.2, WebAPI, ASP.NET MVC, jQuery, CSS, Bootstrap, JavaScript, HTML and UIKit."            
        ]
    },
    {
        "organization": "Rosenau transport Ltd.",
        "title": "Senior Web Software Developer",
        "startDate": "May 2017",
        "endDate": "Apr. 2019",
        "location": "Edmonton, AB Canada",
        "type": "professional",
        "experiences": [
            "Architected and built an enterprise Web Services framework in .NET Core and C# for servicing Rosenau internet and intranet applications.",
            "Created automated deployments (using Microsoft Web Deploy) for the above web services application.",
            "Developed various React Components (with create-react-app) for deployment to Rosenau’s website in WordPress.",
            "Created automated JavaScripts to deploy React components into WordPress.",
            "Performed WordPress administration.",
            "Developed new content from existing custom WordPress templates.",
            "Developed PHP/HTML templates to convert WordPress Gravity Forms data to PDF using Gravity PDF API.",
            "Analysed Rosenau’s existing code (in RPG on IBMi) in order to understand and improve the processes in Rosenau’s communication with third party logistics software (CLI)",
            "Built an application in C# and ASP.NET MVC to monitor above communications (as it was known to be inconsistent).",
            "Ran daily standup meetings.",
            "Tracked work items and projects in Agile/Kanban style with Kanbanize, Trello and Visual Studio Team System (VSTS).",
            "Managed source code with Git and VSTS.",
            "Met with business users to gather requirements and direct user acceptance testing (UAT).",
            "Met our third party software and content development vendor (Punchcard Systems) frequently to discuss, plan and coordinate Rosenau website, customer portal, employee portal, etc. projects.",
            "Helped grow a development team of 1 into 4 developers using agile concepts and software development methodologies and standards to develop into a more efficient and service driven team."
        ],
        "experiencesSimplified": [
            "Architected and built an ended to end solution using WordPress plugins, React and Typescript, customer WordPress deployments, Web Services framework in .NET Core and PHP web services on the IBMi system.",
            "Ran daily stand-up meetings.",
            "Met with business users to gather requirements and direct user acceptance testing (UAT).",
            "Met our third party software and content development vendor (Punchcard Systems) frequently to discuss, plan and coordinate Rosenau website, customer portal, employee portal, etc. projects.",
            "Helped grow a development team of 1 into 4 developers using agile concepts and software development methodologies and standards to develop into a more efficient and service driven team.",
            "Tools/Technologies/Languages/Frameworks: Visual Studio, Visual Studio Unit Tests, C#, PHP, React, Typescript, HTML, CSS, WordPress, Git, Visual Studio Team System (VSTS), Kanbanize, ASP.NET Core, WebAPI, IBM DB2, IBMi, OneNote and Postman."            
        ]
    },
    {
        "organization": "Saputo Inc.",
        "title": "C# Web Developer",
        "startDate": "Oct. 2015",
        "endDate": "Apr. 2017",
        "location": "Edmonton, AB Canada",
        "type": "professional",
        "experiences": [
            "Maintained a list of 38 internal web applications in a team of 11 people with an Agile software development methodology.",
            "Performed feature enhancements to Saputo’s Internet Ordering System (IOS).",
            "Participated in daily scrum sessions and weekly backlog refinement meetings.",
            "Participated in Sprint Planning sessions every 3 weeks.",
            "Discussed problems frequently with Business Analysts and Software Development Managers and suggested solutions.",
            "Changed over multiple projects to use Active Directory’s User Principal Name for user identification and management.",
            "Performed a large refactor on a Project Authorization Request System written in Classic ASP.",
            "Maintained/added new features to/debugged/prepared for production the Canadian version of Saputo’s Micro Tracking Application",
            "Added the ability for customers to choose units or cases of products in Saputo’s Internet Ordering System.",
            "Assisted new employees to get up to speed with the development environment.",
            "Languages/Frameworks/Tools Used: C#, ASP, ASP.NET Web Forms, ASP.NET MVC, jQuery, AngularJS, Entity Framework, ADO.NET, SQL Server and Octopus Deploy",
            "Developer Tools: Git, TFS, Octopus Deploy, SQL Server, IIS, Chrome/IE Developer Tools (debugging)."
            
        ],
        "experiencesSimplified": [
            "Maintained a list of 38 internal web applications in a team of 11 people with an agile software development methodology.",
            "Participated in daily scrum sessions, weekly backlog refinement meetings and Sprint Planning sessions every 3 weeks.",
            "Assisted new employees to get up to speed with the development environment.",
            "Tools/Technologies/Languages/Frameworks: Visual Studio, Visual Studio Unit Tests, Selenium, C#, ASP, ASP.NET Web Forms, ASP.NET MVC, jQuery, HTML, CSS, AngularJS, Entity Framework, ADO.NET, SQL Server and Octopus Deploy."            
        ]
    },
    {
        "organization": "City of Edmonton Current Planning Future State (CPFS)/eServices",
        "title": "C#/ASP.NET/Adobe LiveCycle  Developer",
        "startDate": "Oct. 2012",
        "endDate": "Apr. 2015",
        "location": "Edmonton, AB Canada",
        "type": "professional",
        "experiences": [
            "Participated in design discussions for ASP.NET application and WCF Web Services API  architecture and provided feedback and impact analysis.",
            "Co-Developed front end application in C# and ASP.NET utilizing Telerik ASP.NET Ajax controls.",
            "Developed ASP.NET forms, architecture and business logic from guidance (verbal or written in the form of business requirements) from business analysts, project architects and business stakeholders sometimes in the form of screen mockups and sometimes in the form of business requirements documents.",
            "Co-Developed backend WCF services application in C# utilizing: Log4Net and EntitiesToDtos.",
            "Developed and managed object oriented database objects with LINQ over Entity Framework 5.0.",
            "Co-Managed code branches in Microsoft Team Foundation Server (TFS).",
            "Managed several websites on IIS 7 in Development, UAT and Production environments.",
            "Managed deployments of ASP.NET applications to Development, UAT and Production environments.",
            "Developed and managed databases , tables, stored procedures in SQL Server 2008.",
            "Managed users, groups, services and processes in Adobe LiveCycle administration console.",
            "Developed and managed processes (workflows) within Adobe LiveCycle workbench.",
            "Developed communication between C# business layer code and Adobe LiveCycle using SOAP web service calls and custom data persistence.",
            "Managed source code and tasks  within Microsoft Team Foundation Server.",
            "Participated in daily scrums and bi-weekly sprint planning sessions to plan and estimate tasks.",
            "Built unit test scripts with Visual Studio unit test projects.",
            "Built several ASP.NET user controls for use in multiple pages in the ASP.NET application.",
            "Developed applications for the Development Coordination and Business Licensing streams.",
            "Wrote JavaScript functions to handle client and server postback events for Telerik AJAX controls.",
            "Used Visual Studio XML documentation to document code.",
            "Wrote documentation explaining technical processes such as: how to add users to LiveCycle, how to deploy to production and database objects to include in deployments.",
            "Co-Developed, maintained and documented a custom Adobe LiveCycle API wrapper that hooked into Adobe’s native LiveCycle API.",
            "Managed look and feel of UI components with Telerik UI styles and Cascading Style Sheets (CSS).",
            "Participated in demos of application functionality to CoE staff and stakeholders.",
            "Worked closely with the QA team and business analyst to test deployments to UAT and Production.",
            "Troubleshooted issues with production deployments in web application configuration, web server configuration and database server."
        ],
        "experiencesSimplified": [
            "Co-Developed backend ASP.NET Web forms application for City of Edmonton eServices project Development Coordination section, supporting backend WCF services application and application database.",
            "Managed deployments of ASP.NET applications to Development, UAT and Production environments.",
            "Participated in daily scrums and bi-weekly sprint planning sessions to plan and estimate tasks.",
            "Participated in demos of application functionality to CoE staff and stakeholders.",
            "Worked closely with the QA team and business analyst to test deployments to UAT and Production.",
            "Met frequently with business analysts to review and modify business requirements.",
            "Tools/Technologies/Languages/Frameworks: Visual Studio, Visual Studio Unit Tests, C#, ASP.NET Web Forms, Adobe LiveCycle, JavaScript, HTML, CSS, Telerik, Team Foundation Server (TFS), Windows Communication Foundation (WCF), SQL Server, Log4Net, Entity Framework and IIS."            
        ]
    },
    {
        "organization": "CGI / Alberta Ministry of Justice",
        "title": "Consultant / C# Developer ",
        "startDate": "Jan. 2012",
        "endDate": "Aug. 2012",
        "location": "Edmonton, AB Canada",
        "type": "professional",
        "experiences": [
            "Maintained and improved Windows Communication Foundation (WCF) web services interfaces between ASP.NET Model-View-Controller (MVC) application and TCP/IP interface to Alberta Justice JOIN and system as well as retrieving data from the PRISM system from business requirements.",
            "Designed and provided input on the design WCF service contracts using best practices and standards and provided impact analysis for proposed changes.",
            "Configured tracing, custom logging and monitoring using Windows Server AppFabric to monitor WCF services.",
            "Participated in daily scrums to track, estimate and, report on outstanding tasks with a custom but very detailed spreadsheet.",
            "Managed source code and utilized continuous build functionality within Microsoft Team Foundation Server (TFS)",
            "Built unit test scripts with Visual Studio unit test projects and had them execute in an automated build.",
            "Environment(s): Windows Server 2008, Windows 7, Visual Studio 2010, Team Foundation Server, SQL Server 2008, Hyper-V",
            "Used Visual Studio XML documentation to document code.",
            "Consulted with Ministry of Justice business analysts to gather business requirements.",
            "Visited courtrooms and staff that were actively using the courtroom booking application.",
            "Managed deployments of WCF services to the Production environment and troubleshooted issues that arose."
            
        ],
        "experiencesSimplified": [
            "Maintained and improved web services as a bridge between Courtroom Booking application and to Alberta Justice’s JOIN and the PRISM systems.",
            "Designed and provided input on the design WCF service contracts using best practices and standards and provided impact analysis for proposed changes.",
            "Participated in daily scrums to track, estimate and, report on outstanding tasks with a custom but very detailed spreadsheet.",
            "Consulted verbally with Ministry of Justice business analysts to gather business requirements and followed business requirements documentation to develop new features.",
            "Tools/Technologies/Languages/Frameworks: Visual Studio, Visual Studio Unit Tests, C#, Windows Communication Foundation (WCF), Team Foundation Server (TFS), Windows Server 2008, Windows 7,  SQL Server and Hyper-V."            
        ]
    },
    {
        "organization": "City of Edmonton TACS Project",
        "title": "Consultant / C# Developer Analyst",
        "startDate": "Nov. 2010",
        "endDate": "Dec. 2011",
        "location": "Edmonton, AB Canada",
        "type": "professional",
        "experiences": [
            "Co-designed and developed a Windows Presentation Foundation (WPF) desktop application implementing Prism: Microsoft's implementation of the Model-View-ViewModel (MVVM) design pattern utilizing  Telerik controls for WPF, Telerik OpenAccess ORM for Oracle  and Microsoft SQL Server as data storage.",
            "Implemented Managed Extensibility Framework (MEF) to dynamically load applications, reference objects and subscribe to and publish events.",
            "Developed Windows Communications Foundation (WCF) services to handle running of tasks, review of tasks and approval of tasks.",
            "Managed source code with Team Foundation Server",
            "Maintained and improved a document aggregation tool to allow tax assessors to more easily compile documents for appointments in court for tax claims. Created in Visual Studio 2008 using C#, Model-View-Presenter design pattern, LINQ and Oracle.",
            "Created an interface between Oracle and Adobe LiveCycle for reprinting of correspondence documents. Created using Eclipse for Java and Adobe LiveCycle Workbench.",
            "Managed source code within Microsoft Team Foundation Server.",
            "Met daily with team leader and fellow developers for a 10 minute scrum to play a task lottery (a creative Agile way to estimate, track and report on task status)  on our task board.",
            "Used Visual Studio XML documentation to document code.",
            "Created One Click MSI deployments of windows forms/WPF applications.",
            "Participated in demos and user acceptance testing in front of CoE staff.",
            "Developed new features and improvements to document aggregation tool from both verbal instructions and business requirements documents and provided constant impact analysis to team leader/architect for proposed changes/additions.",
            "Managed database tables, objects, scripts, etc. with TOAD for Oracle."
            
        ],
        "experiencesSimplified": [
            "Co-designed and developed a Windows Presentation Foundation (WPF) desktop application implementing Prism: Microsoft's implementation of the Model-View-ViewModel (MVVM) design pattern utilizing Telerik controls for WPF, Telerik OpenAccess ORM for Oracle and Microsoft SQL Server as data storage.",
            "Maintained and improved a document aggregation tool to allow tax assessors to more easily compile documents for appointments in court for tax claims, created in Visual Studio 2008 using C#, Model-View-Presenter design pattern, LINQ and Oracle.",
            "Met daily with team leader and fellow developers for a 10 minute scrum to play a task lottery (a creative agile way to estimate, track and report on task status) on our task board.",
            "Participated in demos and user acceptance testing in front of CoE staff.",
            "Tools/Technologies/Languages/Frameworks: Visual Studio, Visual Studio Unit Tests, C#, Java, Windows Presentation Foundation (WPF), Windows Forms, Telerik Open Access, Oracle, Toad for Oracle, SQL Server, Managed Extensibility Framework (MEF), Team Foundation Server (TFS) and Adobe LiveCycle."            
        ]
    },
    {
        "organization": "EMIS Inc.",
        "title": "Intermediate C# Developer",
        "startDate": "Feb. 2008",
        "endDate": "Aug. 2010",
        "location": "Edmonton, AB Canada",
        "type": "professional",
        "experiences": [
            "Co-designed, Developed, maintained and improved interoperability components with Alberta Health’s Pharmaceutical Information Network (PIN) in EMIS’ Patient Care System (PCS) from business requirements documents.",
            "Developed new C# components in EMIS’ Patient Care System (PCS) in a combination Delphi/C# Windows forms client, connecting to a middle tier C# business logic layer and a data access layer connecting to SQL Server from business requirements documents.",
            "Developed all of the reporting components for EMIS’ PCS billing module using DataDynamics reports framework, EMIS’ own entity framework and Language Integrated Query (LINQ) from business requirements documents.",
            "Maintained and developed a list of tables, function, stored procedures and other database entities for EMIS PCS in SQL Server",
            "Developed, tested and managed software patches (MSI deployments) using EMIS’ custom deployment software.",
            "Wrote important documents on company processes for ISO certification.",
            "Worked on two small projects where I performed business analyst and systems analyst duties and created business requirements documentation deliverables.",
            "Managed Cruise Control build server and SVN source control.",
            "Create a Dashboard program for employees to cut down on tedious and error prone tasks.",
            "Participated in scrum meetings and bi-weekly sprint planning sessions to estimate, track and report on tasks and new functionality.",
            "Used Visual Studio XML documentation to document code.",
            "Participated in demos for EMIS clients at the University of Calgary.",
            "Co-inherited a whole billing framework from an international team without much documentation and subsequently improved and maintained the codebase as a team.",
            "Developed flow charts of existing functionality to better understand the flow of events.",
            "Worked closely with the QA team to test functionality before deploying into production.",
            "Troubleshooted and fixed various issues (configuration, code, database, etc.) in the Production environment."
            
        ],
        "experiencesSimplified": [
            "Co-designed, developed maintained and improved new features and interoperability components (with Alberta Health’s Pharmaceutical Information Network (PIN)) in EMIS’ Patient Care System (PCS) from business requirements documents.",
            "Developed all of the reporting components for EMIS’ PCS billing module.",
            "Participated in scrum meetings and bi-weekly sprint planning sessions to estimate, track and report on tasks and new functionality.",
            "Participated in demos for EMIS clients at the University of Calgary.",
            "Worked closely with the QA team to test functionality before deploying into production.",
            "Tools/Technologies/Languages/Frameworks: Visual Studio, C#, SVN, Entity Framework, LINQ, Cruise Control.Net, SQL Server, Windows Forms, DataDynamics"            
        ]
    },
    {
        "organization": "YouInFocusProducts and YouInFocusCoaching",
        "title": "Independent Web Developer ",
        "startDate": "2009",
        "endDate": "2010",
        "location": "Edmonton, AB Canada",
        "type": "professional",
        "experiences": [
            "Gathered requirements from the business owner on how the site should look and feel.",
            "Edited and suggested changes on content that was proposed by the business owner.",
            "Created two multi-page websites for the client using JavaScript, HTML and CSS.",
            "Integrated online payments functionality using PayPal."
        ],
        "experiencesSimplified": [
            "Gathered requirements from the business owner on how the site should look and feel.",
            "Edited and suggested changes on content that was proposed by the business owner.",
            "Created two multi-page websites for the client.",
            "Integrated online payments functionality using PayPal.",
            "Tools/Technologies/Languages/Frameworks: HTML, CSS, JavaScript, Visual Studio"            
        ]
    },
    {
        "organization": "Refresh Bistro",
        "title": "Independent Web Developer",
        "startDate": "Sept. 2009",
        "endDate": "Oct. 2009",
        "location": "Edmonton, AB Canada",
        "type": "professional",
        "experiences": [
            "Created a 6 page static HTML website.",
            "Worked with a designer to incorporate visual components into HTML.",
            "Implemented Cascading Style sheets (CSS) and JavaScript to spice up site look and feel.",
            "Worked with the business owner to improve the operation of the website."            
        ],
        "experiencesSimplified": [
            "Created a 6 page static website.",
            "Worked with a designer to incorporate visual components into HTML.",
            "Worked with the business owner to improve the operation of the website.",
            "Tools/Technologies/Languages/Frameworks: HTML, CSS, JavaScript, Visual Studio"            
        ]
    },
    {
        "organization": "Quercus Solutions / Alberta School Employee Benefit Plan (ASEBP)",
        "title": "Consultant / C#.NET Developer",
        "startDate": "Jan. 2007",
        "endDate": "Feb. 2008",
        "location": "Edmonton, AB Canada",
        "type": "professional",
        "experiences": [
            "Co-Developed and maintained several ASP.NET Web Services applications from business requirements documents.",
            "Deployed ASP.NET Web Service applications to Development, UAT and Production environments.",
            "Developed Orchestrations in BizTalk Server 2006 to manage complex transactions over disparate or disconnected systems from business requirements documents.",
            "Developed and managed databases , tables, stored procedures in SQL Server 2008.",
            "Managed and deployed BizTalk Server applications into Development, UAT and Production environments.",
            "Troubleshooted technical issues that would arise for business users in the production environment.",
            "Managed source code in Microsoft Team Foundation Server (TFS).",
            "Used Visual Studio XML documentation to document code.",
            "Researched several different business rules engines for possible application in the enterprise environment.",
            "Lead and participated in demos and presentations to ASEBP staff members.",
            "Developed new features from written business requirements and meetings with ASEBP staff and provided impact analysis on proposed changes."
        ],
        "experiencesSimplified": [
            "Co-Developed and maintained several ASP.NET Web Services in C# applications from business requirements documents.",
            "Lead and participated in demos and presentations to ASEBP staff members.",
            "Developed new features from written business requirements and meetings with ASEBP staff and provided impact analysis on proposed changes. ",
            "Participated in team and client group and one on one meetings to review and flesh out requirements.",
            "Tools/Technologies/Languages/Frameworks: Visual Studio, C#, Biztalk Server, ASP.NET Web Services, IIS, Team Foundation Server (TFS), SQL Server"            
        ]
    },
    {
        "organization": "Sport and Event Registrar",
        "title": "Programmer/Analyst",
        "startDate": "Apr. 2006",
        "endDate": "Sept. 2006",
        "location": "Edmonton, AB Canada",
        "type": "professional",
        "experiences": [
            "Maintained and added new features to a J2EE sporting registration website using Java Server Pages and Struts.",
            "Created reports with Jasper Reports.",
            "Built and maintained database objects in MySQL.",
            "Implemented new features and bug fixes under time constraints. ",
            "Maintained code in CVS source control.",
            "Managed look and feel of UI components with Cascading Style Sheets (CSS)"            
        ],
        "experiencesSimplified": [
            "Maintained and added new features to a sporting registration website.",
            "Tools/Technologies/Languages/Frameworks: Eclipse, Java, J2EE, Struts, Java Server Pages (JSP), CVS, MySQL, CVS, HTML, CSS, JavaScript and Jasper Reports."            
        ]
    },
    {
        "organization": "CodeBaby",
        "title": "Deployment Specialist/Software Developer",
        "startDate": "May 2006",
        "endDate": "Dec. 2006",
        "location": "Edmonton, AB Canada",
        "type": "internship",
        "experiences": [
            "Developed deployments of CodeBaby virtual agent content including Flash, XML, JavaScript, CSS and other media.",
            "Worked on projects for clients such as Alltel, Bell, DirecTV and RBC.",
            "Design and development of new features in CodeBaby’s Production Studio using Borland C++.",
            "Performed quality assurance and user acceptance testing.",
            "Researched several CMS systems such as Drupal and Joomla for possible use in CodeBaby’s website."            
        ],
        "experiencesSimplified": [
            "Developed deployments of CodeBaby virtual agent content including Flash, XML, JavaScript, CSS and other media.",
            "Worked on projects for clients such as Alltel, Bell, DirecTV and RBC.",
            "Design and development of new features in CodeBaby’s Production Studio using Borland C++.",
            "Performed quality assurance and user acceptance testing.",
            "Researched several CMS systems such as Drupal and Joomla for possible use in CodeBaby’s website."
        ]
    },
    {
        "organization": "Alberta Health and Wellness Information Resource Management",
        "title": "Metadata Analyst",
        "startDate": "Sept. 2005",
        "endDate": "Dec. 2005",
        "location": "Edmonton, AB Canada",
        "type": "internship",
        "experiences": [
            "Independently completed a four month proof of concept project showing the value and feasibility in extending the capabilities of the existing metadata repository.",
            "Designed and implemented a scaled down version of the production repository in SQL Server 2000.",
            "Developed a scanner program in C# which enabled capture and storage of data access metadata from Java source code.",
            "Built an ASP.NET application to show impact analysis and statistical reports based on data collected.",
            "Reported findings to the Information Resource Management team in an oral and written format.",
            "Managed look and feel and behaviour of UI components with JavaScript and Cascading Style Sheets (CSS)."
        ],
        "experiencesSimplified": [
            "Independently completed a four month proof of concept project showing the value and feasibility in extending the capabilities of the existing metadata repository.",
            "Designed and implemented a scaled down version of the production repository in SQL Server 2000.",
            "Developed a scanner program in C# which enabled capture and storage of data access metadata from Java source code.",
            "Built an ASP.NET application to show impact analysis and statistical reports based on data collected.",
            "Reported findings to the Information Resource Management team in an oral and written format.",
            "Managed look and feel and behaviour of UI components with JavaScript and Cascading Style Sheets (CSS)."
        ]
    },
    {
        "organization": "DSME Online Testing System - NAIT CST Final Project",
        "title": "Team Leader and Developer",
        "startDate": "Sept. 2006",
        "endDate": "Dec. 2006",
        "location": "Edmonton, AB Canada",
        "type": "school",
        "experiences": [
            "Guided group members through four project phases: inception, elaboration, construction and deployment.",
            "Held frequent meetings with clients.",
            "Developed an automated testing system and an administration system using Windows Forms, Visual Basic.NET 2005 and SQL Server Express 2005.",
            "Publicly presented the system to peers, instructors and clients."
        ],
        "experiencesSimplified": [
            "Guided group members through four project phases: inception, elaboration, construction and deployment.",
            "Held frequent meetings with clients.",
            "Developed an automated testing system and an administration system using Windows Forms, Visual Basic.NET 2005 and SQL Server Express 2005.",
            "Publicly presented the system to peers, instructors and clients."
        ]
    }
]